{
  "About-Screen-Body": "We have a bunch of officers. Here they are!",
  "About-Screen-Header": "About Us",
  "About-Screen-Officer": "Officer",
  "About-Screen-Text1": "Singing in a group gives us a chance to release, express, and collaborate. It allows us to be creative and artistic, all the while sharing that experience with others. Wow. What a joy!!!!",
  "About-Screen-Text2": "In Rose City Choral Collective, we strive to improve our understanding of musical interpretation, musical terms/knowledge, and singing skills, while rehearsing together each week. Working and growing together is a major part of the fun!!",
  "About-Screen-Text3": "Our music spans a variety of genres and, historically, is derived from the 6th century to current songs of note. It's exciting to work on music that is new to us, as well as songs we already cherish. We love sharing our joy of music with each other, and look forward to sharing our music with the public at performances.",
  "About-Screen-Text4": "We have a very friendly group of singers that includes varying skill levels, as each person is on their own musical-learning journey. We are supportive of each other, celebrating our achievements, and encourage each other to grow and learn along the way. (See “How To Become A Member” for information on joining us)",
  "About-Screen-Text5": "We love making music together!! It's a compelling antidote to the “ordinary” of our everyday routines.",
  "About-Screen-Text6": "In harmony,",
  "About-Screen-Text7": "Lyn",
  "About-Screen-Text8": "(Artistic Director)",
  "About-Screen-President": "President",
  "About-Screen-President-Description": "Molly",
  "About-Screen-Title": "About",
  "About-Screen-Vice-President": "Annie",
  "About-Screen-Zosia": "Zosia",
  "Contact-Page-Title": "Contact us",
  "Event-Card-Image-Error": "Image asset not found for this card. Sorry :(",
  "Event-Detail-Header": "This is the coolest event",
  "Event-Detail-Body": "Featuring Molly, Holly, Hollie, Olly, Squally, and Reginald P Linux",
  "EventList-Page-Link": "Learn More",
  "EventList-Page-Title": "Events",
  "EventList-Page-Upcoming-Header": "Upcoming Events!",
  "EventList-Page-Previous-Header": "Previous Events...",
  "Home-Page-Welcome-Header": "Welcome to the Rose City Choral Collective website! ",
  "Home-Page-Old-Browser": "Sorry, your browser does not support embedded video",
  "Home-Page-Welcome1": "We are an independent group of singers who gather together in the spirit of community and a love of music. We sing. We laugh. We sing some more. Occasionally, we perform a concert.",
  "Home-Page-Welcome2": "Our unique blend of singers come from many walks of life and diverse experience with music. We hope you’ll consider joining us in this adventure by adding your voice to our ensemble, joining the audience for a concert, or even gifting financial support to our organization.",
  "Home-Page-Welcome3": "Currently, during the Covid-19 pandemic, we are not rehearsing in person to ensure the health and safety of our members and community. However, we are finding creative ways to gather, learn, and explore music together.",
  "Home-Page-Welcome4": "Please reach out if you’re interested in getting to know us!",
  "Home-Page-Title": "Home",
  "Join-Page-Body-2": "You are not required to have any formal music education. However, we do expect you to sing on pitch and have some basic sight-reading ability. We rehearse Thursday nights in SE Portland. If you are interested in joining, please fill out the form below and we will contact you with more information. Thank you for your interest in RCCC!",
  "Join-Page-Body": "We are looking for singers to join our musical community! ",
  "Join-Page-Header": "Come sing with Rose City Choral Collective!",
  "Join-Page-Preference-Dropdown-Email": "Email",
  "Join-Page-Preference-Dropdown-Helptext": "How should we contact you?",
  "Join-Page-Preference-Dropdown-Phone": "Phone",
  "Join-Page-Submit-Button": "Submit",
  "Join-Page-Submitted-Toast": "Submitted. We'll get in touch soon!",
  "Join-Page-Textfield-Email": "Email Address",
  "Join-Page-Textfield-FirstName": "First Name",
  "Join-Page-Textfield-Infofield": "Any additional information?",
  "Join-Page-Textfield-LastName": "Last Name",
  "Join-Page-Textfield-Phone": "Phone Number",
  "Join-Page-Title": "Join us!",
  "Organization-Name": "Rose City Choral Collective",
  "Support-Page-Title": "Support us"
}